class Vaccine_info{
  String disease;
  String vaccine;
  String place;
  String amount;
  String schedule;
  String cautions;
  String description;
  String image;

  Vaccine_info(
      {

        required this.disease,
        required this.vaccine,
        required this.place,
        required this.amount,
        required this.schedule,
        required this.cautions,
        required this.description,
        required this.image,

      }
      );
}

List<Vaccine_info> Vaccine_infoList =[
  Vaccine_info(disease: 'তড়কা',vaccine:'তড়কা রোগের টিকা (Anthrax Vaccine)',place:'পশুর ঘাড়ের/গলার  চামড়ার নিচে',amount:'***চিকিৎসকের পরামর্শ অনুযায়ী মাত্রা নির্ধারণ করুন***\nগরু ও মহিষের জন্য টিকার মাত্রা হল ১ মিলি\nছাগল ও ভেড়ার জন্য ০.৫ মিলি',schedule:'পশুর ৬ মাস বয়সে প্রথম টিকা দিতে হয়। প্রথম বার ভ্যাকসিন দেবার পর বছরে ১বার করে দিতে হবে।',cautions:' ৭ মাসের ঊর্দ্ধ বয়সের গর্ভবতী গরু/মহিষকে দেয়া যাবে না। ছাগল/ভেড়ার ক্ষেত্রে গর্ভধারণের ৩ মাস পরে  দেয়া যাবে না ।', description:'তড়কা টিকা ১০০ মিলি বোতলে তরল অবস্থায় থাকে। পশুর ৬ মাস বয়সে প্রথম টিকা দিতে হয়। গরু ও মহিষের জন্য টিকার মাত্রা হল ১ মিলি. এবং ছাগল ও ভেড়ার জন্য ০.৫ মিলি। ১ বছর অন্তর এ টিকা দিতে হয়। এ টিকা পশুর ঘাড়ের/গলার  চামড়ার নিচে দিতে হয়। তবে ৭ মাসের ঊর্দ্ধ বয়সের গর্ভবতী গরু/মহিষকে দেয়া যাবে না। ছাগল/ভেড়ার ক্ষেত্রে গর্ভধারণের ৩ মাস পরে  দেয়া যাবে না ।',image:'assets/anthrax.jpg'),
  Vaccine_info(disease: 'গলাফুলা',vaccine:'গলাফুলা রেগের টিকা (Haemorrahagic Septicemia vaccine)',place:'পশুর ঘাড়ের চামড়ার নিচে দিতে হয়',amount:'***চিকিৎসকের পরামর্শ অনুযায়ী মাত্রা নির্ধারণ করুন***\nগরু ও মহিষের জন্য টিকার মাত্রা হল ২ মিলি\nছাগল ও ভেড়ার জন্য ১ মিলি',schedule:'পশুর ৬ মাস বয়সে প্রথম টিকা দিতে হয়।  প্রথম বার ভ্যাকসিন দেবার পর প্রতি ৬ মাস অন্তর টিকা দিতে হয়।',cautions:'৬ মাসের উপরের গর্ভবতী গাভীকে দেওয়া যাবে না এবং প্রথম টিকা দেওয়ার পর ২-৪ সপ্তাহ পর আর একটি সমপরিমান ডোজ দিতে হবে।', description:'গলাফুলা টিকা ১০০ মিলি তরল অবস্থায় বোতলে থাকে। পশুর ৬ মাস বয়সে প্রথম টিকা দিতে হয়। গরু ও মহিষের জন্য টিকার মাত্রা হল ২ মিলি. এবং ছাগল ও ভেড়ার জন্য ১ মিলি।  প্রতি ৬ মাস অন্তর টিকা দিতে হয়। এ টিকাও  পশুর ঘাড়ের চামড়ার নিচে দিতে হয়।',image:'assets/golafola.png'),
  Vaccine_info(disease: 'বাদলা',vaccine:'বাদলা রোগের টিকা (Black Quarter Vaccine)',place:'পশুর ঘাড়ের চামড়ার নিচে দিতে হয়',amount:'***চিকিৎসকের পরামর্শ অনুযায়ী মাত্রা নির্ধারণ করুন***\nগরু ও মহিষের জন্য মাত্রা হল ৫ মিলি\nছাগল ও ভেড়ার জন্য ২ মিলি',schedule:'পশুর ৬ মাস বয়সে প্রথম টিকা দিতে হয়।  প্রথম বার ভ্যাকসিন দেবার পর প্রতি ৬ মাস অন্তর টিকা দিতে হয়।', cautions:'৪ মাস বয়সের বাছুর থেকে ২.৫ মাস বয়সের গরুকে দিতে হবো প্রাপ্ত বয়স্ক পশুকে দেবার দরকার নাই',description:'বাদলা রোগের টিকা ১০০ মিলি তরল অবস্থায় বোতলে থাকে। পশুর ৬ মাস বয়সে প্রথম টিকা দিতে হয়। গরু ও মহিষের জন্য মাত্রা হল ৫ মিলি এবং ছাগল ও ভেড়ার জন্য ২ মিলি। প্রতি ৬ মাস অন্তর টিকা দিতে হয়। এ টিকা পশুর ঘাড়ের চামড়ার নিচে দিতে হয়। তবে এ রোগের টিকা   ২.৫-৩ বছর পরে আর গরু/ মহিষকে দেয়ার প্রয়োজন হয় না ।',image:'assets/bq.png'),
  Vaccine_info(disease: 'ক্ষুরা রোগ',vaccine:'ক্ষুরা রোগের টিকা (Foot & Mouth Disease Vaccine)',place:'এ টিকা পশুর ঘাড়ের চামড়ার নিচে দিতে হয়',amount:'***চিকিৎসকের পরামর্শ অনুযায়ী মাত্রা নির্ধারণ করুন***\nমনোভ্যালেন্ট, বাইভ্যালেন্ট ও ট্রাইভ্যালেন্ট, ইত্যাদি। গরু ও মহিষের জন্য ভ্যাকসিনের মাত্রা মনো হলে ৩, বাই হলে ৬ এবং ট্রাই হলে ৯ মিলি এবং ছাগল ও ভেড়ার জন্য গরুর অর্ধেক ডোজ দিতে হয়',schedule:'এই ভ্যাকসিন গরুর ৪মাস বয়স থেকে দিতে হয়।১ম ভোজের ১মাস পর ২য় ভোজ এবং এরপর প্রতি ৬মাস অন্তর অন্তর এটা দিতে হবে।',cautions:'৪ মাস বয়স থেকে শুরু করে যেকোন বয়সের পশুকে এমনকি গর্ভবতী গাভীকে দেওয়া যাবে।', description:'ক্ষুরা রোগের টিকা বোতলে তরল অবস্থায় থাকে। পশুর ৪ মাস বয়সে প্রথম টিকা দিতে হয়। এ রোগের বিভিন্ন স্ট্রেইনের জন্য বিভিন্ন ভ্যাকসিন পাওয়া যায় যেমন- মনোভ্যালেন্ট, বাইভ্যালেন্ট ও ট্রাইভ্যালেন্ট, ইত্যাদি। গরু ও মহিষের জন্য ভ্যাকসিনের মাত্রা মনো হলে ৩, বাই হলে ৬ এবং ট্রাই হলে ৯ মিলি এবং ছাগল ও ভেড়ার জন্য গরুর অর্ধেক ডোজ দিতে হয়। প্রতি ৪ মাস অন্তর টিকা দিতে হয়। এ টিকা পশুর ঘাড়ের চামড়ার নিচে দিতে হয়। উল্লেখ্য, গর্ভবতী পশুকেও এ টিকা দেয়া যায়।',image:'assets/F&M.jpg'),
  Vaccine_info(disease: 'জলাতঙ্ক',vaccine:'জলাতঙ্ক রোগের টিকা (Rabies Vaccine)	',place:'মাংশপেশীতে',amount:'***চিকিৎসকের পরামর্শ অনুযায়ী মাত্রা নির্ধারণ করুন***\n৩ সিসি',schedule:'১ম দিন ৪ মিলি  ৪ স্থানে   ১ মিলি করে, ৭ম দিনে ৩ মিলি ৩ স্থানে ১ মিলি করে এবং ২১তম দিনে  ৩ স্থানে ১ মিলি করে ৩ মিলি মাংসে দিতে হয়',cautions:'৬ মাস বয়সের উপরে দেওয়া যাবে এবং গর্ভবতী পশুকেও দেওয়া যাবে', description:'জলাতঙ্কের জন্য দুই ধরনের টিকা পাওয়া যায়, যথা: HEP and LEP। জলাতঙ্ক রোগের টিকা ভায়ালে বা এম্পুলে হিমশুষ্ক অবস্থায় থাকে। ভায়ালের টিকা     ৩ মিলি বিশুদ্ধ (Distilled water) পানিতে মিশিয়ে সম্পূর্ণ টিকা মাংসপেশীতে ইনজেকশন করতে হয়।     উল্লে­খ্য HEP (GBP Bwc) টিকা বিশুদ্ধ পানিতে মিশিয়ে  ১.৫ মিলি পরিমাণ গরু ও মহিষের ৬ মাস বয়সে মাংসপেশীতে ইনজেকশন করতে হয়। LEP (GI Bwc) কুকুরের ৩ মাস বয়সে প্রথম এবং প্রতি বছর একই নিয়মে এ টিকা (৩.০ মিলি) দিতে হয়। এছাড়াও পশুকে কুকুরে কামড়ানোর পরে পোস্ট এক্সপোসার ভ্যাকসিন এআরভি (Anti Rabies vaccine/ ARV) দিতে হয়। বেসরকারি ওষুধ কোম্পানির র‌্যাবিসিন (Rabisin) ভ্যাকসিন পাওয়া যায়। মাত্রা হলো- ১ম দিন ৪ মিলি  ৪ স্থানে   ১ মিলি করে, ৭ম দিনে ৩ মিলি ৩ স্থানে ১ মিলি করে এবং ২১তম দিনে  ৩ স্থানে ১ মিলি করে ৩ মিলি মাংসে দিতে হয় ।',image:'assets/gol.jpg'),

];